{
  "meta": { "theme": "jsonresume-theme-relaxed" },
  "basics": {
    "name": "Andrew G. Grossman, MSc, MBA",
    "label": "",
    "NoResumesInUSimage": "https://avatars.githubusercontent.com/u/1409332?v=4",
    "email": "andrewgrossman.developer@gmail.com",
    "phone": "(410) 645-0462",
    "summary": "Seasoned developer and engineering lead with a background in commercial data collection and processing. I have a strong background in PostgreSQL, Python, and Django, with experience in AWS, ETL, optimization, and software development management. ",
    "location": {
      "city": "Baltimore",
      "countryCode": "US",
      "region": "Maryland"
    },
    "profiles": [{
        "url": "https://github.com/AndrewGrossman",
        "username": "AndrewGrossman",
        "network": "github"
      },
      {
        "url": "https://www.linkedin.com/in/andrew-grossman-13a3bb10/",
        "username": "andrew-grossman-13a3bb10",
        "network": "linkedin"
      }]
  },
  "work": [
    {
      "name": "Cabinet Health",
      "position": "Staff Backend Engineer",
      "url": "https://cabinethealth.com",
      "startDate": "2024-05-20",
      "endDate": "2025-01-03",
      "summary": "Backend engineer for Cabinet's online pharmacy offering. Implemented software features in a Python/Django-based system supporting the customer account portal, internal business management systems, and integrations with pharmacy partners.",
      "highlights": [
      "Cleaned and optimized third-party medical provider data. Developed efficient API endpoints capable of handling 10 million provider records with limited infrastructure resources.",
      "Led efforts to clear a backlog of over 50 outstanding customer issues, helping the company to align and protect its brand.",
      "Implemented an automated notification system to send timely SMS and email alerts, increasing refill rates and reducing pharmacy staff manual work.",
      "Implemented business reporting for senior leadership using Metabase."
      ]
    },
    {
    "name": "Songtrust / Downtown Music Publishing",
    "position": "Director of Software Engineering",
    "url": "https://songtrust.com",
    "startDate": "2023-07-01",
    "endDate": "2024-04-01",
    "summary": "Engineering lead for the Songtrust product team. Responsible for the development and maintenance of the Songtrust.com web application with 30k+ active users, as well as internal facing enterprise tools. Managed a team of 6 engineers.",
    "highlights": [
      "Guided the technical implementation of key application features, via team planning, ticketing, and code reviews.",
      "Functioned as departmental service owner for Postgres. Managed AWS RDS Postgres instances, including right-sizing, cost management, major version upgrades, and parameter configuration. Mentored new departmental DBA.",
      "Completed initiative to verify user identities, reactivating stalled business partnership impacting $2M of customer earnings.",
      "Implemented SLA for incoming support requests, ensuring 95% of requests are responded to within 24 hours. Cleared 9 month request backlog in 3 months.",
      "Drove completion of a dozen features previously stalled between code deployment and product acceptance QA activities.",
      "Applied more comprehensive monitoring and alerting, identifying ~75% of user-facing issues before they were reported.",
      "Assisted in additional cost-cutting measures, including identifying $35K/year of since-realized savings in cloud costs.",
      "Ensured high morale and team stability, increasing overall productivity. Onboarded 3 new engineers."
    ]
  },
  {
    "name": "Songtrust / Downtown Music Publishing",
    "position": "Engineering Manager",
    "url": "https://songtrust.com",
    "startDate": "2020-01-01",
    "endDate": "2023-06-30",
    "summary": "Team lead / back-end developer for a greenfield application managing music industry intellectual properties for the purpose of royalty collection.",
    "highlights": [
      "Architected data model, including support for robust auditability.",
      "Set up a flexible Django/DRF environment with custom primitives for advanced Postgres feature usage.",
      "Designed and implemented a custom ETL pipeline using Python and SQL for data ingress from multiple systems, including MS SQL Server sourced data.",
      "Maintained application deployment environments (AWS EC2/RDS Postgres/S3).",
      "Involved in and executed on departmental leadership initiatives focused on reaching an enterprise-level of governance, stability, and process.",
      "Drove approach to reduce data record rejections from business partners by 95% versus the previous system.",
      "Managed and refined team agile processes and development workflows, including JIRA configurations.",
      "Responsible for managing and mentoring 9 engineers on multiple development teams."
    ]
  },
  {
    "name": "Songtrust / Downtown Music Publishing",
    "position": "Senior Software Engineer",
    "url": "https://songtrust.com",
    "startDate": "2018-06-16",
    "endDate": "2019-12-31",
    "summary": "Full-stack developer on a consumer-facing PostgreSQL/Python/Django/Ubuntu/AWS-hosted consumer-facing application for facilitating songwriter royalties collection.",
    "highlights": [
      "Implemented a feature to allow users to share songwriters across accounts 3 months ahead of schedule.",
      "Optimized database queries and application performance.",
      "Implemented new front-end features in a legacy jQuery/Backbone environment."
    ]
  },
  {
    "name": "Bridgestone Commercial Solutions",
    "position": "Software Lead / Development Manager",
    "url": "https://commercial.bridgestone.com/",
    "startDate": "2012",
    "endDate": "2018",
    "summary": "Led a team of of 8 developers to build a commercial data collection product, that served as a key differentiator in the retread service package offering to hundreds of B2B customers. Product was built using a Django/Dojo/PostgreSQL/RHEL stack. At time of departure, the application had over 600 users and had collected over 3 million survey readings.",
    "highlights": [
      "Implemented data model providing for auditability and multi-faceted authorization controls.",
      "Scripted imports (ETL) of third-party data from various formats into PostgreSQL database.",
      "Implemented initial Django/Tastypie/Dojo-based patterns used as the base for the application.",
      "Assigned tasks, provided task documentation, reviewed work, and consulted on work within the engineering team.",
      "Coordinated development activities with product manager, project manager, QA team, and target users.",
      "Performed managerial duties, including hiring, termination, and performance reviews.",
      "Managed developer and testing VM instances (KVM, VMWare)."
    ]
  },
  {
    "name": "Bridgestone Commercial Solutions",
    "position": "Software Developer",
    "url": "https://commercial.bridgestone.com/",
    "startDate": "2003",
    "endDate": "2012",
    "summary": "Developed and administered Django-based commercial website for the tracking of national trucking fleet inventories. System consolidated data from over 30 Postgres-based systems into a single reporting database. Resulting website is now marketed directly to large trucking fleets including Waste Management, Ryder, and UPS, leading to increased sales of the company's core product. Product was built using a Django/YUI 2/PostgreSQL/RHEL stack. Worked on other software products as needed.",
    "highlights": [
      "Provided custom reporting and querying of a PostgreSQL database for data mining purposes.",
      "Implemented features in a C/Curses-based/Informix CISAM TUI application used for the management of tire retread shops.",
      "Developed CakePHP-based data reporting website for corporate usage.",
      "Developed Visual Basic 6 / Access based reporting application for use by over 100 commercial clients."
    ]
  }
  ],
  "removed_work_for_space": [
    {
      "name": "Stifel Nicolaus",
      "position": "Outside Software Consultant",
      "startDate": "2007",
      "endDate": "2018",
      "summary": "Developed advanced Microsoft Excel applications w/VBA for stock selection and tracking.",
      "url": "https://www.stifel.com/"
    }
  ],
  "education": [
    {
      "institution": "University of Baltimore",
      "url": "https://www.ubalt.edu/",
      "area": "Master of Business Administration",
      "endDate": "2014"
    },
    {
      "institution": "UMBC",
      "url": "https://umbc.edu/",
      "area": "Master of Science in Computer Science",
      "endDate": "2007",
      "courses": [
        "Completed research paper in algorithm development including simulation and statistical analysis entitled \"Indirect Data Reporting in Wireless Sensor Networks with Multiple Mobile Nodes.\""
      ]
    },
    {
      "institution": "University of Maryland, College Park",
      "url": "https://maryland.edu/",
      "area": "Bachelor of Science in Computer Science",
      "commentedstudyType": "Bachelor of Science",
      "endDate": "2001"
    }
  ],
  "skills": [
    {
      "name": "Python",
      "level": "Senior",
      "keywords": [
        "Django",
        "Django Rest Framework",
        "SQLAlchemy",
        "Celery"
      ]
    },
    {
      "name": "PostgreSQL",
      "level": "Senior",
      "keywords": [
        "SQL",
        "pl/pgsql",
        "Query Optimization",
        "ETL",
        "RDS",
        "Data Modeling"
      ]
    },
    {
      "name": "AWS",
      "level": "Advanced",
      "keywords": [
        "RDS",
        "EC2",
        "S3",
        "Lambda"
      ]
    },
    {
      "name": "Software Development",
      "level": "Senior",
      "keywords": [
        "JIRA",
        "CircleCI",
        "Git",
        "GitHub 🥚",
        "Datadog",
        "REST API",
        "Confluence"
      ]
    },
    {
      "name": "Engineering Management",
      "level": "Advanced",
      "keywords": [
        "People Management",
        "People Development",
        "Agile"
      ]
    },
    {
      "name": "Technical Potpourri",
      "level": "Intermediate",
      "keywords": [
        "Excel",
        "Visual Basic / VBA",
        "Microsoft SQL Server",
        "Bash",
        "Linux",
        "Javascript"
      ]
    }
  ]
}
